

class sSettt():

    def __init__(self):
        self.classes = {
            'Z': {
                1: {
                    'Mon': {
                        '1': ['Информатика', '310'],
                        '2': ['Физика', '207'],
                        '3': ['Литература', '119'],
                        '4': ['Биология', '215'],
                            '5': ['Физра', 'Сами знаете где']},
                    'Tue': {
                        '1': ['Физра', 'Сами знаете где'],
                        '2': ['Инглиш', '211'],
                        '3': ['Геометрия', '317'],
                        '4': ['ППВ', 'свалишь, получишь'],
                            '5': ['Информатика', '310']},
                    'Wed': {
                        '1': ['Информатика', '310'],
                        '2': ['География', '215'],
                        '3': ['Литература', '119'],
                        '4': ['Алгебра', '317'],
                            '5': ['Физика', '410']},
                    'Thu': {
                        '1': ['Физика', '410'],
                        '2': ['Химия', '316'],
                        '3': ['Информатика', '310'],
                        '4': ['История', '108'],
                            '5': ['Общага', '108']},
                    'Fri': {
                        '1': ['Общага', '108'],
                        '2': ['Лекция', '208'],
                        '3': ['Алгебра', '317'],
                        '4': ['Русский', '117'],
                            '5': ['Отдыхай уже', 'Бро']},
                    'Sat': {
                        '1': ['Отдыхай уже', 'Бро'],
                        '2': ['Отдыхай уже', 'Бро'],
                        '3': ['Отдыхай уже', 'Бро'],
                        '4': ['Русский', '117'],
                            '5': ['Отдыхай уже', 'Бро']},
                    'Sun': {
                        '1': ['Отдыхай уже', 'Бро'],
                        '2': ['Отдыхай уже', 'Бро'],
                        '3': ['Отдыхай уже', 'Бро'],
                        '4': ['Отдыхай уже', 'Бро'],
                            '5': ['Информатика', '310']}
                },
                2: {
                    'Mon': {
                        '1': ['Информатика', '309'],
                        '2': ['Физика', '207'],
                        '3': ['Литература', '119'],
                        '4': ['Биология', '215']},
                    'Tue': {
                        '1': ['Физра', 'Сами знаете где'],
                        '2': ['Инглиш', '211'],
                        '3': ['Геометрия', '317'],
                        '4': ['ППВ', 'свалишь, получишь']},
                    'Wed': {
                        '1': ['Информатика', '309'],
                        '2': ['География', '215'],
                        '3': ['Литература', '119'],
                        '4': ['Алгебра', '317']},
                    'Thu': {
                        '1': ['Физика', '410'],
                        '2': ['Химия', '316'],
                        '3': ['Информатика', '309'],
                        '4': ['История', '108']},
                    'Fri': {
                        '1': ['Общага', '108'],
                        '2': ['Лекция', '208'],
                        '3': ['Алгебра', '317'],
                        '4': ['Русский', '117']},
                    'Sat': {
                        '1': ['Информатика', '310'],
                        '2': ['Информатика', '310'],
                        '3': ['Информатика', '310']},
                    'Sun': {
                        '1': ['Отдыхай уже', 'Бро'],
                        '2': ['Лекция', '208'],
                        '3': ['Алгебра', '317'],
                        '4': ['Русский', '117']}
                }
        },
            'E': {
                1: {
                    'Mon': {
                        '1': ['Инглиш', '411'],
                        '2': ['Литература', '119'],
                        '3': ['Русский', '110'],
                        '4': ['ХОБА', 'Ничего нет'],
                            '5': ['Алгебра', '207']},
                    'Tue': {
                        '1': ['Алгебра', '207'],
                        '2': ['Экономика', '424'],
                        '3': ['География', '215'],
                        '4': ['ППВ', 'свалишь, получишь'],
                            '5': ['Нет ничего', 'спи, пока можешь']},
                    'Wed': {
                        '1': ['Нет ничего', 'спи, пока можешь'],
                        '2': ['Информатика', '309'],
                        '3': ['Физика', '121'],
                        '4': ['Алгебра', '207'],
                            '5': ['Геометрия', '207']},
                    'Thu': {
                        '1': ['Геометрия', '207'],
                        '2': ['Инглиш', '411'],
                        '3': ['История', '108'],
                        '4': ['Физика', '206'],
                            '5': ['Химия', '316']},
                    'Fri': {
                        '1': ['Химия', '316'],
                        '2': ['Физра', 'Сами знаете где'],
                        '3': ['Обществознание', '108'],
                        '4': ['Капец везет', 'Ничего нет'],
                            '5': ['Отдыхай уже', 'Бро']},
                    'Sat': {
                        '1': ['Отдыхай уже', 'Бро'],
                        '2': ['Отдыхай уже', 'Бро'],
                        '3': ['Отдыхай уже', 'Бро'],
                        '4': ['Отдыхай уже', 'Бро'],
                            '5': ['Отдыхай уже', 'Бро']},
                    'Sun': {
                        '1': ['Отдыхай уже', 'Бро'],
                        '2': ['Отдыхай уже', 'Бро'],
                        '3': ['Отдыхай уже', 'Бро'],
                        '4': ['Отдыхай уже', 'Бро'],
                            '5': ['Биология', '215']}
                },
                2: {
                    'Mon': {
                        '1': ['Инглиш', '319'],
                        '2': ['Литература', '119'],
                        '3': ['Физика', '306'],
                        '4': ['ХОБА', 'Ничего нет'],
                            '5': ['Русский', '122']},
                    'Tue': {
                        '1': ['Русский', '122'],
                        '2': ['Геометрия', '317'],
                        '3': ['География', '215'],
                        '4': ['ППВ', 'свалишь, получишь'],
                            '5': ['Алгебра', '317']},
                    'Wed': {
                        '1': ['Алгебра', '317'],
                        '2': ['Физика', '121'],
                        '3': ['Химия', '211'],
                        '4': ['Отдыхай', 'Вали пока не поздно'],
                            '5': ['Физика', '416']},
                    'Thu': {
                        '1': ['Физика', '416'],
                        '2': ['Инглиш', '319'],
                        '3': ['История', '108'],
                        '4': ['Информатика', '306'],
                            '5': ['Алгебра', '317']},
                    'Fri': {
                        '1': ['Алгебра', '317'],
                        '2': ['Физра', 'Сами знаете где'],
                        '3': ['Обществознание', '108'],
                        '4': ['Экономика', '424'],
                            '5': ['Отдыхай уже', 'Бро']},
                    'Sat': {
                        '1': ['Отдыхай уже', 'Бро'],
                        '2': ['Отдыхай уже', 'Бро'],
                        '3': ['Отдыхай уже', 'Бро'],
                        '4': ['Отдыхай уже', 'Бро'],
                            '5': ['Отдыхай уже', 'Бро']},
                    'Sun': {
                        '1': ['Отдыхай уже', 'Бро'],
                        '2': ['Отдыхай уже', 'Бро'],
                        '3': ['Отдыхай уже', 'Бро'],
                        '4': ['Отдыхай уже', 'Бро'],
                            '5': ['Биология', '215']}
                }
            }
}
