

class sSettt():

    def __init__(self):
        self.Z = {'Z1': {
    'Mon': {
        '1': ['Информатика', '310'],
        '2': ['Физика', '207'],
        '3': ['Литература', '119'],
        '4': ['Биология', '215']},
    'Tue': {
        '1': ['Физра', 'Сами знаете где'],
        '2': ['Инглиш', '211'],
        '3': ['Геометрия', '317'],
        '4': ['ППВ', 'свалишь, получишь']},
    'Wed': {
        '1': ['Информатика', '310'],
        '2': ['География', '215'],
        '3': ['Литература', '119'],
        '4': ['Алгебра', '317']},
    'Thu': {
        '1': ['Физика', '410'],
        '2': ['Химия', '316'],
        '3': ['Информатика', '310'],
        '4': ['История', '108']},
    'Fri': {
        '1': ['Общага', '108'],
        '2': ['Лекция', '208'],
        '3': ['Алгебра', '317'],
        '4': ['Русский', '117']},
    'Sat': {
        '1': ['Информатика', '310'],
        '2': ['Информатика', '310'],
        '3': ['Информатика', '310']},
    'Sun': {
        '1': ['Отдыхай уже', 'Бро'],
        '2': ['Лекция', '208'],
        '3': ['Алгебра', '317'],
        '4': ['Русский', '117']}
},

'Z2': {
    'Mon': {
        '1': ['Информатика', '310'],
        '2': ['Физика', '207'],
        '3': ['Литература', '119'],
        '4': ['Биология', '215']},
    'Tue': {
        '1': ['Физра', 'Сами знаете где'],
        '2': ['Инглиш', '211'],
        '3': ['Геометрия', '317'],
        '4': ['ППВ', 'свалишь, получишь']},
    'Wed': {
        '1': ['Информатика', '310'],
        '2': ['География', '215'],
        '3': ['Литература', '119'],
        '4': ['Алгебра', '317']},
    'Thu': {
        '1': ['Физика', '410'],
        '2': ['Химия', '316'],
        '3': ['Информатика', '310'],
        '4': ['История', '108']},
    'Fri': {
        '1': ['Общага', '108'],
        '2': ['Лекция', '208'],
        '3': ['Алгебра', '317'],
        '4': ['Русский', '117']},
    'Sat': {
        '1': ['Информатика', '310'],
        '2': ['Информатика', '310'],
        '3': ['Информатика', '310']},
    'Sun': {
        '1': ['Отдыхай уже', 'Бро'],
        '2': ['Лекция', '208'],
        '3': ['Алгебра', '317'],
        '4': ['Русский', '117']}
}}