

class sSettt():

    def __init__(self):
        self.classes = [{
            'Z': {
                1: {
                    'Mon': {
                        '1': ['Информатика', '310'],
                        '2': ['Физика', '207'],
                        '3': ['Литература', '119'],
                        '4': ['Биология', '215'],
                            '5': ['Физра', 'Сами знаете где']},
                    'Tue': {
                        '1': ['Физра', 'Сами знаете где'],
                        '2': ['Инглиш', '211'],
                        '3': ['Геометрия', '317'],
                        '4': ['ППВ', 'свалишь, получишь'],
                            '5': ['Информатика', '310']},
                    'Wed': {
                        '1': ['Информатика', '310'],
                        '2': ['География', '215'],
                        '3': ['Литература', '119'],
                        '4': ['Алгебра', '317'],
                            '5': ['Физика', '410']},
                    'Thu': {
                        '1': ['Физика', '410'],
                        '2': ['Химия', '316'],
                        '3': ['Информатика', '310'],
                        '4': ['История', '108'],
                            '5': ['Общага', '108']},
                    'Fri': {
                        '1': ['Общага', '108'],
                        '2': ['Лекция', '208'],
                        '3': ['Алгебра', '317'],
                        '4': ['Русский', '117'],
                            '5': ['Отдыхай уже', 'Бро']},
                    'Sat': {
                        '1': ['Отдыхай уже', 'Бро'],
                        '2': ['Отдыхай уже', 'Бро'],
                        '3': ['Отдыхай уже', 'Бро'],
                        '4': ['Отдыхай уже', 'Бро'],
                            '5': ['Отдыхай уже', 'Бро']},
                    'Sun': {
                        '1': ['Отдыхай уже', 'Бро'],
                        '2': ['Отдыхай уже', 'Бро'],
                        '3': ['Отдыхай уже', 'Бро'],
                        '4': ['Отдыхай уже', 'Бро'],
                            '5': ['Информатика', '310']}
                },
                2: {
                    'Mon': {
                        '1': ['Физика', '408'],
                        '2': ['Информатика', '309'],
                        '3': ['Литература', '119'],
                        '4': ['Биология', '215'],
                            '5': ['Физра', 'Сами знаете где']},
                    'Tue': {
                        '1': ['Физра', 'Сами знаете где'],
                        '2': ['Инглиш', '319'],
                        '3': ['Алгебра', '118'],
                        '4': ['ППВ', 'свалишь, получишь'],
                            '5': ['Спи и спи и... ', 'спи']},
                    'Wed': {
                        '1': ['Спи и спи и... ', 'спи'],
                        '2': ['География', '215'],
                        '3': ['Литература', '119'],
                        '4': ['Физика', '408'],
                            '5': ['Геометрия', '208']},
                    'Thu': {
                        '1': ['Геометрия', '208'],
                        '2': ['Информатика', '309'],
                        '3': ['Химия', '418'],
                        '4': ['История', '108'],
                            '5': ['Общага', '108']},
                    'Fri': {
                        '1': ['Общага', '108'],
                        '2': ['Лекция', '208'],
                        '3': ['РУсский', '122'],
                        '4': ['Геометрия', '208'],
                            '5': ['Отдыхай уже', 'Бро']},
                    'Sat': {
                        '1': ['Отдыхай уже', 'Бро'],
                        '2': ['Отдыхай уже', 'Бро'],
                        '3': ['Отдыхай уже', 'Бро'],
                        '4': ['Отдыхай уже', 'Бро'],
                            '5': ['Отдыхай уже', 'Бро']},
                    'Sun': {
                        '1': ['Отдыхай уже', 'Бро'],
                        '2': ['Отдыхай уже', 'Бро'],
                        '3': ['Отдыхай уже', 'Бро'],
                        '4': ['Отдыхай уже', 'Бро'],
                            '5': ['Физика', '408']}
                }
            },
            'J': {
                1: {
                    'Mon': {
                        '1': ['Химия(зс)', '418'],
                        '2': ['Алгебра(лекция, твоя любимая)', '208'],
                        '3': ['Инглиш', '121'],
                        '4': ['Геометрия', '118'],
                            '5': ['Физра', 'Сами знаете где']},
                    'Tue': {
                        '1': ['Физра', 'Сами знаете где'],
                        '2': ['ОБЖ', '217'],
                        '3': ['Физика', '410'],
                        '4': ['ППВ', 'свалишь, получишь'],
                            '5': ['Алгебра(зс)', '424']},
                    'Wed': {
                        '1': ['Алгебра(зс)', '424'],
                        '2': ['Руссиш', '110'],
                        '3': ['Литра', '407'],
                        '4': ['Информатика', '308'],
                            '5': ['Инглиш', '121']},
                    'Thu': {
                        '1': ['Инглиш', '121'],
                        '2': ['История', '108'],
                        '3': ['Алгебра', '209'],
                        '4': ['Физика', '424'],
                            '5': ['Химия', '418']},
                    'Fri': {
                        '1': ['Химия', '418'],
                        '2': ['География', '215'],
                        '3': ['Физика', '314'],
                        '4': ['Биология', '215'],
                            '5': ['Отдыхай уже', 'Бро']},
                    'Sat': {
                        '1': ['Отдыхай уже', 'Бро'],
                        '2': ['Отдыхай уже', 'Бро'],
                        '3': ['Отдыхай уже', 'Бро'],
                        '4': ['Отдыхай уже', 'Бро'],
                            '5': ['Отдыхай уже', 'Бро']},
                    'Sun': {
                        '1': ['Отдыхай уже', 'Бро'],
                        '2': ['Отдыхай уже', 'Бро'],
                        '3': ['Отдыхай уже', 'Бро'],
                        '4': ['Отдыхай уже', 'Бро'],
                            '5': ['Химия(зс)', '418']}
                },
                2: {
                    'Mon': {
                        '1': ['Экология', '408'],
                        '2': ['Алгебра(лекция, твоя любимая)', '208'],
                        '3': ['Инглиш', '411'],
                        '4': ['Биология', '320'],
                            '5': ['Физра', 'Сами знаете где']},
                    'Tue': {
                        '1': ['Физра', 'Сами знаете где'],
                        '2': ['ОБЖ', '217'],
                        '3': ['Информатика', '306'],
                        '4': ['ППВ', 'свалишь, получишь'],
                            '5': ['Алгебра(зс)', '314']},
                    'Wed': {
                        '1': ['Алгебра(зс)', '314'],
                        '2': ['Химия', '316'],
                        '3': ['Литра', '407'],
                        '4': ['Физика', '418'],
                            '5': ['Инглиш', '121']},
                    'Thu': {
                        '1': ['Инглиш', '411'],
                        '2': ['История', '108'],
                        '3': ['Геометрия', '208'],
                        '4': ['Биология', '320'],
                            '5': ['Руссиш', '122']},
                    'Fri': {
                        '1': ['Руссиш', '122'],
                        '2': ['География', '215'],
                        '3': ['Алгебра', '208'],
                        '4': ['Пустота', 'Вали домой, нет пар'],
                            '5': ['Отдыхай уже', 'Бро']},
                    'Sat': {
                        '1': ['Отдыхай уже', 'Бро'],
                        '2': ['Отдыхай уже', 'Бро'],
                        '3': ['Отдыхай уже', 'Бро'],
                        '4': ['Отдыхай уже', 'Бро'],
                            '5': ['Отдыхай уже', 'Бро']},
                    'Sun': {
                        '1': ['Отдыхай уже', 'Бро'],
                        '2': ['Отдыхай уже', 'Бро'],
                        '3': ['Отдыхай уже', 'Бро'],
                        '4': ['Отдыхай уже', 'Бро'],
                            '5': ['Экология', '408']}
                }
            },
            'E': {
                1: {
                    'Mon': {
                        '1': ['Инглиш', '411'],
                        '2': ['Литература', '119'],
                        '3': ['Русский', '110'],
                        '4': ['ХОБА', 'Ничего нет'],
                            '5': ['Алгебра', '207']},
                    'Tue': {
                        '1': ['Алгебра', '207'],
                        '2': ['Экономика', '424'],
                        '3': ['География', '215'],
                        '4': ['ППВ', 'свалишь, получишь'],
                            '5': ['Нет ничего', 'спи, пока можешь']},
                    'Wed': {
                        '1': ['Нет ничего', 'спи, пока можешь'],
                        '2': ['Информатика', '309'],
                        '3': ['Физика', '121'],
                        '4': ['Алгебра', '207'],
                            '5': ['Геометрия', '207']},
                    'Thu': {
                        '1': ['Геометрия', '207'],
                        '2': ['Инглиш', '411'],
                        '3': ['История', '108'],
                        '4': ['Физика', '206'],
                            '5': ['Химия', '316']},
                    'Fri': {
                        '1': ['Химия', '316'],
                        '2': ['Физра', 'Сами знаете где'],
                        '3': ['Обществознание', '108'],
                        '4': ['Капец везет', 'Ничего нет'],
                            '5': ['Отдыхай уже', 'Бро']},
                    'Sat': {
                        '1': ['Отдыхай уже', 'Бро'],
                        '2': ['Отдыхай уже', 'Бро'],
                        '3': ['Отдыхай уже', 'Бро'],
                        '4': ['Отдыхай уже', 'Бро'],
                            '5': ['Отдыхай уже', 'Бро']},
                    'Sun': {
                        '1': ['Отдыхай уже', 'Бро'],
                        '2': ['Отдыхай уже', 'Бро'],
                        '3': ['Отдыхай уже', 'Бро'],
                        '4': ['Отдыхай уже', 'Бро'],
                            '5': ['Инглиш', '411']}
                },
                2: {
                    'Mon': {
                        '1': ['Инглиш', '319'],
                        '2': ['Литература', '119'],
                        '3': ['Физика', '306'],
                        '4': ['ХОБА', 'Ничего нет'],
                            '5': ['Русский', '122']},
                    'Tue': {
                        '1': ['Русский', '122'],
                        '2': ['Геометрия', '317'],
                        '3': ['География', '215'],
                        '4': ['ППВ', 'свалишь, получишь'],
                            '5': ['Алгебра', '317']},
                    'Wed': {
                        '1': ['Алгебра', '317'],
                        '2': ['Физика', '121'],
                        '3': ['Химия', '211'],
                        '4': ['Отдыхай', 'Вали пока не поздно'],
                            '5': ['Физика', '416']},
                    'Thu': {
                        '1': ['Физика', '416'],
                        '2': ['Инглиш', '319'],
                        '3': ['История', '108'],
                        '4': ['Информатика', '306'],
                            '5': ['Алгебра', '317']},
                    'Fri': {
                        '1': ['Алгебра', '317'],
                        '2': ['Физра', 'Сами знаете где'],
                        '3': ['Обществознание', '108'],
                        '4': ['Экономика', '424'],
                            '5': ['Отдыхай уже', 'Бро']},
                    'Sat': {
                        '1': ['Отдыхай уже', 'Бро'],
                        '2': ['Отдыхай уже', 'Бро'],
                        '3': ['Отдыхай уже', 'Бро'],
                        '4': ['Отдыхай уже', 'Бро'],
                            '5': ['Отдыхай уже', 'Бро']},
                    'Sun': {
                        '1': ['Отдыхай уже', 'Бро'],
                        '2': ['Отдыхай уже', 'Бро'],
                        '3': ['Отдыхай уже', 'Бро'],
                        '4': ['Отдыхай уже', 'Бро'],
                            '5': ['Инглиш', '319']}
                }
            }
},
        {
            'Z': {
                1: {
                    'Mon': {
                        '1': ['Русский', '117'],
                        '2': ['Физика', '415'],
                        '3': ['Химия', '316'],
                        '4': ['ЕЕЕЕ', 'ХАЛЯВА'],
                            '5': ['Физра', 'Сами знаете где']},
                    'Tue': {
                        '1': ['Физра', 'Сами знаете где'],
                        '2': ['Информатика', '310'],
                        '3': ['Инглиш', '211'],
                        '4': ['ППВ', 'свалишь, получишь'],
                            '5': ['Алгебра', '317']},
                    'Wed': {
                        '1': ['Алгебра', '317'],
                        '2': ['Физика', '413'],
                        '3': ['Литература', '119'],
                        '4': ['ОБЖ', '110'],
                            '5': ['Информатика', '310']},
                    'Thu': {
                        '1': ['Информатика', '310'],
                        '2': ['История', '108'],
                        '3': ['Алгебра', '317'],
                        '4': ['География', '215'],
                            '5': ['Инглиш', '211']},
                    'Fri': {
                        '1': ['Инглиш', '211'],
                        '2': ['Геометрия', '317'],
                        '3': ['Русский', '117'],
                        '4': ['Черчение', '425'],
                            '5': ['Геометрия', '317']},
                    'Sat': {
                        '1': ['Геометрия', '317'],
                        '2': ['Отдыхай уже', 'Бро'],
                        '3': ['Отдыхай уже', 'Бро'],
                        '4': ['Отдыхай уже', 'Бро'],
                            '5': ['Отдыхай уже', 'Бро']},
                    'Sun': {
                        '1': ['Отдыхай уже', 'Бро'],
                        '2': ['Отдыхай уже', 'Бро'],
                        '3': ['Отдыхай уже', 'Бро'],
                        '4': ['Отдыхай уже', 'Бро'],
                            '5': ['Русский', '117']}
                },
                2: {
                    'Mon': {
                        '1': ['Пустота', 'ничего'],
                        '2': ['Информатика', '309'],
                        '3': ['Алгебра', '206'],
                        '4': ['СД ИТА', '310'],
                            '5': ['Физра', 'Сами знаете где']},
                    'Tue': {
                        '1': ['Физра', 'Сами знаете где'],
                        '2': ['Русский', '122'],
                        '3': ['Инглиш', '319'],
                        '4': ['ППВ', 'свалишь, получишь'],
                            '5': ['Черчение', '120']},
                    'Wed': {
                        '1': ['Черчение', '120'],
                        '2': ['Физика', '408'],
                        '3': ['Литература', '119'],
                        '4': ['ОБЖ', '110'],
                            '5': ['Информатика', '309']},
                    'Thu': {
                        '1': ['Информатика', '309'],
                        '2': ['История', '108'],
                        '3': ['Алгебра', '208'],
                        '4': ['География', '215'],
                            '5': ['Инглиш', '319']},
                    'Fri': {
                        '1': ['Инглиш', '319'],
                        '2': ['Геометрия', '208'],
                        '3': ['Химия', '320'],
                        '4': ['Русский', '122'],
                            '5': ['Ничего', 'Первое ничего...']},
                    'Sat': {
                        '1': ['Пусто', 'Спатьь'],
                        '2': ['Физика', '408'],
                        '3': ['Алгебра', '208'],
                        '4': ['Отдыхай уже', 'Бро'],
                            '5': ['Отдыхай уже', 'Бро']},
                    'Sun': {
                        '1': ['Отдыхай уже', 'Бро'],
                        '2': ['Отдыхай уже', 'Бро'],
                        '3': ['Отдыхай уже', 'Бро'],
                        '4': ['Отдыхай уже', 'Бро'],
                            '5': ['Пустота', 'ничего']}
                }
            },
            'J': {
                1: {
                    'Mon': {
                        '1': ['Геометрия', '108'],
                        '2': ['Химия', '418'],
                        '3': ['Инглиш', '121'],
                        '4': ['Халява', 'Cheel-out'],
                            '5': ['Физра', 'Сами знаете где']},
                    'Tue': {
                        '1': ['Физра', 'Сами знаете где'],
                        '2': ['История', '108'],
                        '3': ['Общага', '108'],
                        '4': ['ППВ', 'свалишь, получишь'],
                            '5': ['Литра', '407']},
                    'Wed': {
                        '1': ['Литра', '407'],
                        '2': ['Руссиш', '117'],
                        '3': ['Алгебра', '117'],
                        '4': ['Информатика', '308'],
                            '5': ['География', '215']},
                    'Thu': {
                        '1': ['География', '215'],
                        '2': ['Физика', '425'],
                        '3': ['Литра', '407'],
                        '4': ['Алгебра', '209'],
                            '5': ['СД', '418']},
                    'Fri': {
                        '1': ['СД', '418'],
                        '2': ['Руссиш', '218'],
                        '3': ['Химия', '418'],
                        '4': ['Домой иди', 'Ниче нет'],
                            '5': ['Физика', '424']},
                    'Sat': {
                        '1': ['Физика', '424'],
                        '2': ['География', '211'],
                        '3': ['Отдыхай уже', 'Бро'],
                        '4': ['Отдыхай уже', 'Бро'],
                            '5': ['Отдыхай уже', 'Бро']},
                    'Sun': {
                        '1': ['Отдыхай уже', 'Бро'],
                        '2': ['Отдыхай уже', 'Бро'],
                        '3': ['Отдыхай уже', 'Бро'],
                        '4': ['Отдыхай уже', 'Бро'],
                            '5': ['Геометрия', '108']}
                },
                2: {
                    'Mon': {
                        '1': ['Геометрия(зс)', '209'],
                        '2': ['Физика', '206'],
                        '3': ['Инглиш', '411'],
                        '4': ['Химия', '316'],
                            '5': ['Физра', 'Сами знаете где']},
                    'Tue': {
                        '1': ['Физра', 'Сами знаете где'],
                        '2': ['История', '108'],
                        '3': ['Общага', '108'],
                        '4': ['ППВ', 'свалишь, получишь'],
                            '5': ['Литра', '407']},
                    'Wed': {
                        '1': ['Литра', '407'],
                        '2': ['Физика', '121'],
                        '3': ['Химия', '316'],
                        '4': ['Халява', 'Cheel-out'],
                            '5': ['География', '215']},
                    'Thu': {
                        '1': ['География', '215'],
                        '2': ['Руссиш', '122'],
                        '3': ['Литра', '407'],
                        '4': ['Биология', '320'],
                            '5': ['Руссиш', '122']},
                    'Fri': {
                        '1': ['Руссиш', '122'],
                        '2': ['Физика', '307'],
                        '3': ['Геометрия', '208'],
                        '4': ['Домой иди', 'Ниче нет'],
                            '5': ['СД', '316']},
                    'Sat': {
                        '1': ['СД', '316'],
                        '2': ['Биология(зс)', '314А'],
                        '3': ['Химия(зс)', '316'],
                        '4': ['Отдыхай уже', 'Бро'],
                            '5': ['Отдыхай уже', 'Бро']},
                    'Sun': {
                        '1': ['Отдыхай уже', 'Бро'],
                        '2': ['Отдыхай уже', 'Бро'],
                        '3': ['Отдыхай уже', 'Бро'],
                        '4': ['Отдыхай уже', 'Бро'],
                            '5': ['Геометрия(зс)', '209']}
                }
            },
            'E': {
                1: {
                    'Mon': {
                        '1': ['Инглиш', '411'],
                        '2': ['Литература', '119'],
                        '3': ['Русский', '110'],
                        '4': ['ХОБА', 'Ничего нет'],
                            '5': ['Алгебра', '207']},
                    'Tue': {
                        '1': ['Алгебра', '207'],
                        '2': ['Экономика', '424'],
                        '3': ['География', '215'],
                        '4': ['ППВ', 'свалишь, получишь'],
                            '5': ['Нет ничего', 'спи, пока можешь']},
                    'Wed': {
                        '1': ['Нет ничего', 'спи, пока можешь'],
                        '2': ['Информатика', '309'],
                        '3': ['Физика', '121'],
                        '4': ['Алгебра', '207'],
                            '5': ['Геометрия', '207']},
                    'Thu': {
                        '1': ['Геометрия', '207'],
                        '2': ['Инглиш', '411'],
                        '3': ['История', '108'],
                        '4': ['Физика', '206'],
                            '5': ['Химия', '316']},
                    'Fri': {
                        '1': ['Химия', '316'],
                        '2': ['Физра', 'Сами знаете где'],
                        '3': ['Обществознание', '108'],
                        '4': ['Капец везет', 'Ничего нет'],
                            '5': ['Отдыхай уже', 'Бро']},
                    'Sat': {
                        '1': ['Отдыхай уже', 'Бро'],
                        '2': ['Отдыхай уже', 'Бро'],
                        '3': ['Отдыхай уже', 'Бро'],
                        '4': ['Отдыхай уже', 'Бро'],
                            '5': ['Отдыхай уже', 'Бро']},
                        'Sun': {
                        '1': ['Отдыхай уже', 'Бро'],
                        '2': ['Отдыхай уже', 'Бро'],
                        '3': ['Отдыхай уже', 'Бро'],
                        '4': ['Отдыхай уже', 'Бро'],
                            '5': ['Инглиш', '411']}
                },
                2: {
                    'Mon': {
                        '1': ['Инглиш', '319'],
                        '2': ['Литература', '119'],
                        '3': ['Физика', '306'],
                        '4': ['ХОБА', 'Ничего нет'],
                            '5': ['Русский', '122']},
                    'Tue': {
                        '1': ['Русский', '122'],
                        '2': ['Геометрия', '317'],
                        '3': ['География', '215'],
                        '4': ['ППВ', 'свалишь, получишь'],
                            '5': ['Алгебра', '317']},
                    'Wed': {
                        '1': ['Алгебра', '317'],
                        '2': ['Физика', '121'],
                        '3': ['Химия', '211'],
                        '4': ['Отдыхай', 'Вали пока не поздно'],
                            '5': ['Физика', '416']},
                    'Thu': {
                        '1': ['Физика', '416'],
                        '2': ['Инглиш', '319'],
                        '3': ['История', '108'],
                        '4': ['Информатика', '306'],
                            '5': ['Алгебра', '317']},
                    'Fri': {
                        '1': ['Алгебра', '317'],
                        '2': ['Физра', 'Сами знаете где'],
                        '3': ['Обществознание', '108'],
                        '4': ['Экономика', '424'],
                            '5': ['Отдыхай уже', 'Бро']},
                    'Sat': {
                        '1': ['Отдыхай уже', 'Бро'],
                        '2': ['Отдыхай уже', 'Бро'],
                        '3': ['Отдыхай уже', 'Бро'],
                        '4': ['Отдыхай уже', 'Бро'],
                            '5': ['Отдыхай уже', 'Бро']},
                    'Sun': {
                        '1': ['Отдыхай уже', 'Бро'],
                        '2': ['Отдыхай уже', 'Бро'],
                        '3': ['Отдыхай уже', 'Бро'],
                        '4': ['Отдыхай уже', 'Бро'],
                            '5': ['Инглиш', '319']}
                }
            }
        }
    ]
