

class sSettt():

    def __init__(self):
        self.classes = {
            'Z': {
                1: {
                    'Mon': {
                        '1': ['Информатика', '310'],
                        '2': ['Физика', '207'],
                        '3': ['Литература', '119'],
                        '4': ['Биология', '215'],
                            '5': ['Физра', 'Сами знаете где']},
                    'Tue': {
                        '1': ['Физра', 'Сами знаете где'],
                        '2': ['Инглиш', '211'],
                        '3': ['Геометрия', '317'],
                        '4': ['ППВ', 'свалишь, получишь'],
                            '5': ['Информатика', '310']},
                    'Wed': {
                        '1': ['Информатика', '310'],
                        '2': ['География', '215'],
                        '3': ['Литература', '119'],
                        '4': ['Алгебра', '317'],
                            '5': ['Физика', '410']},
                    'Thu': {
                        '1': ['Физика', '410'],
                        '2': ['Химия', '316'],
                        '3': ['Информатика', '310'],
                        '4': ['История', '108'],
                            '5': ['Общага', '108']},
                    'Fri': {
                        '1': ['Общага', '108'],
                        '2': ['Лекция', '208'],
                        '3': ['Алгебра', '317'],
                        '4': ['Русский', '117'],
                            '5': ['Отдыхай уже', 'Бро']},
                    'Sat': {
                        '1': ['Отдыхай уже', 'Бро'],
                        '2': ['Отдыхай уже', 'Бро'],
                        '3': ['Отдыхай уже', 'Бро'],
                        '4': ['Русский', '117'],
                            '5': ['Отдыхай уже', 'Бро']},
                    'Sun': {
                        '1': ['Отдыхай уже', 'Бро'],
                        '2': ['Отдыхай уже', 'Бро'],
                        '3': ['Отдыхай уже', 'Бро'],
                        '4': ['Отдыхай уже', 'Бро'],
                            '5': ['Информатика', '310']}
                },
                2: {
                    'Mon': {
                        '1': ['Физика', '408'],
                        '2': ['Информатика', '309'],
                        '3': ['Литература', '119'],
                        '4': ['Биология', '215'],
                            '5': ['Физра', 'Сами знаете где']},
                    'Tue': {
                        '1': ['Физра', 'Сами знаете где'],
                        '2': ['Инглиш', '319'],
                        '3': ['Алгебра', '118'],
                        '4': ['ППВ', 'свалишь, получишь'],
                            '5': ['Нет ничего', 'спи, пока можешь']},
                    'Wed': {
                        '1': ['Нет ничего', 'спи, пока можешь'],
                        '2': ['География', '215'],
                        '3': ['Литература', '119'],
                        '4': ['Физика', '408'],
                            '5': ['Геометрия', '208']},
                    'Thu': {
                        '1': ['Геометрия', '208'],
                        '2': ['Информатика', '309'],
                        '3': ['Химия', '418'],
                        '4': ['История', '108'],
                            '5': ['Общага', '108']},
                    'Fri': {
                        '1': ['Общага', '108'],
                        '2': ['Лекция', '208'],
                        '3': ['Русский', '122'],
                        '4': ['Геометрия', '208'],
                            '5': ['Отдыхай уже', 'Бро']},
                    'Sat': {
                        '1': ['Отдыхай уже', 'Бро'],
                        '2': ['Отдыхай уже', 'Бро'],
                        '3': ['Отдыхай уже', 'Бро'],
                        '4': ['Русский', '117'],
                            '5': ['Отдыхай уже', 'Бро']},
                    'Sun': {
                        '1': ['Отдыхай уже', 'Бро'],
                        '2': ['Отдыхай уже', 'Бро'],
                        '3': ['Отдыхай уже', 'Бро'],
                        '4': ['Отдыхай уже', 'Бро'],
                            '5': ['Физика', '408']}
                }
        }
}
